import random

try:
    #Користувач вводить дані
    minNum = input("Введіть мінімальне ціле значення числа у списку: ")
    maxNum = input("І введіть максимальне ціле значення: ")
    numLen = input("Введіть довжину списку (список повинен мати значення більше, ніж 1): ")

    #Перевіряємо, чи користувач щось ввів
    if minNum == "" or maxNum == "" or numLen == "":
        raise ValueError("Ви не ввели один, два або жодного значення")

    #Перетворюємо рядки на цілі числа
    minNum = int(minNum)
    maxNum = int(maxNum)
    numLen = int(numLen)

    #Перевіряємо, чи maxNum більший за minNum
    if maxNum < minNum:
       raise ValueError("Максимальне значення повинно бути більшим за мінімальне")

    #Перевіряємо, чи довжина списку більша за 1
    if numLen <= 1:
        raise ValueError("Довжина списку повинна бути більшою за 1")

    #Створюється список, причому у випадковому порядку
    lst = []
    for _ in range(numLen):
        lst_random = random.randint(minNum, maxNum)
        lst.append(lst_random)

    #Обчислюється середнє арифмет.знач. у списку
    avg = sum(lst) / len(lst)

    #Ці дані позначатимуть елементи, які менше за середнє арифмет.знач.
    sum_below_avg = 0
    count_below_avg = 0

    #Копіюємо список, аби додавати елементи суми та лічильника в окремий список
    lst2 = lst[:]

    #Робота з елементами списку
    for number in lst2:
        #Якщо елемент менший за середнє, додаємо його до суми і збільшуємо лічильник
        if number < avg:
            sum_below_avg += number
            count_below_avg += 1

    #Додаємо значення суми і кількості до кінця початкового списку
    lst2.append(sum_below_avg)
    lst2.append(count_below_avg)

    #Обчислюється середнє арифмет.знач. у списку з новими значеннями
    avg1 = sum(lst2) / len(lst2)

    #Створюємо третій список з тих елементів, які дорівнюють серед.арифмет.
    lst3 = []
    for x in lst2:
        if x == avg:
            lst3.append(x)

    #Якщо для третього списку не знайшлося значень, то виведимо гарне повідомлення про відсутність значень
    if lst3 == []:
        lst3 = ("Немає значень")

    #Виводимо результати на екран. Викорустовуються різні методи форматування залежно від типу виводу
    print("Початковий список: {}".format(lst))
    print(f"Середнє арифметичне: {avg:.2f}")
    print("Сума елементів, які менші за середнє: {}".format(sum_below_avg))
    print("Кількість елементів, які менші за середнє: {}".format(count_below_avg))
    print("Початковий список із новими елементами: {}".format(lst2))
    print(f"Середнє арифметичне списку з новими алементами: {avg:.2f}")
    print("Третій список: {}".format(lst3))

except ValueError as text_of_error:
    #Виводимо повідомлення про помилку
    print("\nПомилка: {}".format(text_of_error))