import shelve

# Створюємо клас Countries, який приймає словник країн
class Countries:
    def __init__(self, data):
        self.data = data

    # Метод для отримання кількості країн
    def count(self):
        return len(self.data)

    # Метод для отримання списку країн за алфавітом
    def sort(self):
        return sorted(self.data.keys())

    # Метод для отримання інформації про країну за назвою
    def info(self, name):
        if name in self.data:
            return self.data[name]
        else:
            return "Немає такої країни"

countries = Countries({
    "Україна": ("Київ", 839, 2966000),
    "Франція": ("Париж", 105.4, 2148000),
    "Німеччина": ("Берлін", 891.8, 3600000),
    "Італія": ("Рим", 1285, 2873000),
    "Іспанія": ("Мадрид", 604.3, 3223000),
    "Польща": ("Варшава", 517.2, 1790000),
    "США": ("Вашингтон", 177, 705749),
    "Канада": ("Оттава", 2778, 934243),
    "Китай": ("Пекін", 16410.54, 21540000),
    "Японія": ("Токіо", 2187.66, 13929286),
    "Індія": ("Нью-Делі", 42.7, 257803),
    "Бразилія": ("Бразилія", 5802, 3015268),
    "Австралія": ("Канберра", 814.2, 397393)
})

shelve_file = shelve.open("C:\\lab6\\countries")
shelve_file["data"] = countries

# Застосовуємо три методи до модифікації файлу
# Додаємо нову країну
shelve_file["data"].data["Норвегія"] = ("Осло", 454, 681067)

# Видаляємо країну
del shelve_file["data"].data["Бразилія"]

# Змінюємо дані про країну
shelve_file["data"].data["Італія"] = ("Рим", 1285, 2865000)

shelve_file.close()